/**
 * @file lab6_5.c
 * @brief Зсув масиву
 *
 * @author Vasilyazhenko Dmitriy
 * @date 21-dec-2020
 * @version 1.0
 */

/**
 * Розмір матриці
 */
#define N 4
/**
 * функція для циклічного зсуву масива
 *
 * Послідовність дій:
 * - Створення змінних
 * - процес переведення, за допомогою циклу for
 * @return успішний код повернення з програми (0)
 */
void shift()
{
    int array[N][N] = { {1, 2, 3, 4},
                   {5, 6, 7, 8},
                   {9, 10, 43, 12},
                   {13, 14, 15, 22} };
    int buff = array[0][0];
    for (int i = 0; i < N * N; i++) {
        array[0][i] = array[0][i + 1];
    }
    array[N - 1][N - 1] = buff;
}
/**
 * Головна функція.
 *
 * Послідовність дій:
 * - виклик функціїї
 * @return успішний код повернення з програми (0)
 */
int main()
{
    shift();
    return 0;
}
